# 字典定义
students = {
    '2021': {
        '20210011':'忆往普风雨兼程，岁月如歌',
        '20210101':'百年征程波澜壮阔，百年初心历久弥坚。'
    },
    '2020': {
        '20205561':'生日快乐，可爱的中国共产党！',
        '20206082':'没有党，就没有新中国！'
    },
    '2019': {
        '20196011':'冰雪为媒，让我们一起向未来！',
        '20198232':'冬奥之风，点燃了人们的体育热情！'
    }
}
#列出学生学号
stu=[]                              #存放学号列表
print("{:=^25}\n".format('赞赞我的国'))
for key in students.keys():
    for e in students[key].keys():
        stu.append(e)
        print("{:10}{:<20}".format(' ',e))
print("="*30)
# 字典查询
sid = input('请输入你想查询的学号：')   #学号前四位表示入学年份
#判断学号是否存在
if sid in stu:
    print("{}级学生{}对祖国说：\n{}".format(sid[0:4],sid,students[sid[0:4]][sid]))
else:
    print("学号不存在")