d = {"北京大学":"北京", "中国人民大学":"北京","清华大学":"北京",
"北京航空航天大学":"北京","北京理工大学":"北京","中国农业大学":"北京",
"北京师范大学":"北京","中央民族大学":"北京","南开大学":"天津",
"天津大学":"天津","大连理工大学":"辽宁","吉林大学":"吉林",
"哈尔滨工业大学":"黑龙江","复旦大学":"上海", "同济大学":"上海",
"上海交通大学":"上海","华东师范大学":"上海", "南京大学":"江苏",
"东南大学":"江苏","浙江大学":"浙江","中国科学技术大学":"安徽",
"厦门大学":"福建","山东大学":"山东", "中国海洋大学":"山东",
"武汉大学":"湖北","华中科技大学":"湖北", "中南大学":"湖南",
"中山大学":"广东","华南理工大学":"广东", "四川大学":"四川",
"电子科技大学":"四川","重庆大学":"重庆","西安交通大学":"陕西",
"西北工业大学":"陕西","兰州大学":"甘肃", "国防科技大学":"湖南",
"东北大学":"辽宁","郑州大学":"河南", "湖南大学":"湖南", "云南大学":"云南", 
"西北农林科技大学":"陕西", "新疆大学":"新疆"}
counts = {}
for key in d.values():
    counts[key] = counts.get(key,0) + 1
items = list(counts.items())
items.sort(key = lambda x:x[1],reverse=True)
word,count = items[0]
print("{}：{}".format(word,count))